Revit 2026 API

# EnergyDataSettingsCheckRangeOfPercentageSkylights Method

---

Checks that the percentage skylights value is between 0.00 and 0.95.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
```
```vb
Public Shared Function CheckRangeOfPercentageSkylights (
	percentageSkylights As Double
) As Boolean
```
```cpp
public:
static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
```
```fsharp
static member CheckRangeOfPercentageSkylights :
        percentageSkylights : float -> bool
```

#### Parameters

percentageSkylights Double
     The percentage skylights to be checked.

#### Return Value

Boolean True if the percentage skylights value is between 0.00 and 0.95, false otherwise.

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace